---
kind: other
id: Properties.T:Autodesk.Revit.DB.CurveArrArrayIterator
source: html/824881ad-0933-e158-a84f-18a5dc904c09.htm
---
# CurveArrArrayIterator Properties

Retrieves the item that is the current focus of the iterator.